// власні властивості - тіщо створені в коснтрукторі чи створені вручну
// невласні - доступні в обєкті але знаходяться в прототипі

// власні властивості мають пріорітет як в записуванні так і при доступі

// якщо ми перезаписуємо прототип повністю то треба буде ще добавити властивість конструктор вручну

// function Faculty() {
    
// }

// Faculty.prototype={
//     add(){
//         return 2
//     },
//     dec(){
//         return -1
//     },
//     // типу того
//     constructor:Faculty
// }
// console.log(Faculty.prototype.constructor);

